In [2]:
import sqlite3
conn = sqlite3.connect("customers.db")
cursor = conn.cursor()

<img src="db1.png">

In [5]:
cursor.execute("""
CREATE TABLE customerInfo (
customerId INTEGER PRIMARY KEY,
name TEXT,
cName TEXT,
Address TEXT,
cit TEXT,
pCode INTEGER,
Country TEXT
)""")

## Insert Data into DB

In [16]:
cursor.execute("INSERT INTO customerInfo VALUES (20, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt',15337,'USA')")
cursor.execute("INSERT INTO customerInfo VALUES (21, 'Ishaan1', 'Ishaan', 'Centre Ave', 'Pitt',15347,'India')")
cursor.execute("INSERT INTO customerInfo VALUES (23, 'Ishaan2', 'K', 'Beelefonte ', 'Pitt',15335,'USA')")
cursor.execute("INSERT INTO customerInfo VALUES (24, 'CoolPerson', 'A', 'Beeler Street', 'Pitt',15336,'India')")
conn.commit()

## Read From DB

In [17]:
data = cursor.execute('SELECT * FROM customerInfo')
print(data)
data = [x for x in data]
print(data)

<sqlite3.Cursor object at 0x10df17e30>
[(1, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA'), (10, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA'), (11, 'Ishaan1', 'Ishaan', 'Centre Ave', 'Pitt', 15317, 'USA'), (13, 'Ishaan2', 'K', 'Beelefonte ', 'Pitt', 15317, 'USA'), (14, 'CoolPerson', 'A', 'Beeler Street', 'Pitt', 15217, 'USA'), (20, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15337, 'USA'), (21, 'Ishaan1', 'Ishaan', 'Centre Ave', 'Pitt', 15347, 'India'), (23, 'Ishaan2', 'K', 'Beelefonte ', 'Pitt', 15335, 'USA'), (24, 'CoolPerson', 'A', 'Beeler Street', 'Pitt', 15336, 'India')]

## Update DB

In [50]:
cursor.execute("UPDATE customerInfo SET pCode = 321 WHERE customerId = 14")
conn.commit()
data = cursor.execute('SELECT * FROM customerInfo')
print("Data before commiting")
for row in data:
    print(row)

Data before commiting
(1, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA')
(10, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA')
(11, 'Ishaan1', 'Ishaan', 'Centre Ave', 'Pitt', 15317, 'USA')
(13, 'Ishaan2', 'K', 'Beelefonte ', 'Pitt', 15317, 'USA')
(14, 'CoolPerson', 'A', 'Beeler Street', 'Pitt', 321, 'USA')
(20, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15337, 'USA')
(21, 'Ishaan1', 'Ishaan', 'Centre Ave', 'Pitt', 15347, 'India')
(23, 'Ishaan2', 'K', 'Beelefonte ', 'Pitt', 15335, 'USA')
(24, 'CoolPerson', 'A', 'Beeler Street', 'Pitt', 15336, 'India')

## SQL WHERE Clause

The WHERE clause is used to filter records.
The WHERE clause is used to extract only those records that fulfill a specified condition.

SELECT * FROM {TableName}
WHERE Country='India'


SELECT * FROM {TableName}
WHERE pCode BETWEEN 15330 AND 15335;

In [20]:
indiaCustomer = cursor.execute('SELECT * FROM customerInfo WHERE Country="India"')
for row in indiaCustomer:
    print(row)

(21, 'Ishaan1', 'Ishaan', 'Centre Ave', 'Pitt', 15347, 'India')
(24, 'CoolPerson', 'A', 'Beeler Street', 'Pitt', 15336, 'India')

In [23]:
pCode = cursor.execute('SELECT * FROM customerInfo WHERE pCode BETWEEN 15000 AND 15320')
for row in pCode:
    print(row)

(1, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA')
(10, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA')
(11, 'Ishaan1', 'Ishaan', 'Centre Ave', 'Pitt', 15317, 'USA')
(13, 'Ishaan2', 'K', 'Beelefonte ', 'Pitt', 15317, 'USA')
(14, 'CoolPerson', 'A', 'Beeler Street', 'Pitt', 15217, 'USA')

## The SQL ORDER BY Keyword

SELECT * FROM {TableName}
ORDER BY Country

In [47]:
pCode = cursor.execute('SELECT * FROM customerInfo ORDER BY pCode')
for row in pCode:
    print(row)

(14, 'CoolPerson', 'A', 'Beeler Street', 'Pitt', 15217, 'USA')
(1, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA')
(10, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA')
(11, 'Ishaan1', 'Ishaan', 'Centre Ave', 'Pitt', 15317, 'USA')
(13, 'Ishaan2', 'K', 'Beelefonte ', 'Pitt', 15317, 'USA')
(23, 'Ishaan2', 'K', 'Beelefonte ', 'Pitt', 15335, 'USA')
(24, 'CoolPerson', 'A', 'Beeler Street', 'Pitt', 15336, 'India')
(20, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15337, 'USA')
(21, 'Ishaan1', 'Ishaan', 'Centre Ave', 'Pitt', 15347, 'India')

In [ ]:
pCode = cursor.execute('SELECT * FROM customerInfo ORDER BY Address')
for row in pCode:
    print(row)

## Min and Max Operations

In [28]:
minP = cursor.execute("SELECT MIN(pCode)FROM customerInfo")

In [29]:
for row in minP:
    print(row)

(15217,)

## Count, Avg, Sum

In [42]:
count = cursor.execute("SELECT COUNT(customerId)FROM customerInfo")
for row in count:
    print(row)

(9,)

In [40]:
avg = cursor.execute("SELECT AVG(pCode)FROM customerInfo")
for row in avg:
    print(row)

(15315.555555555555,)

In [41]:
sum1 = cursor.execute("SELECT SUM(pCode)FROM customerInfo")
for row in sum1:
    print(row)

(137840,)

## Like Operator

WHERE name LIKE 'a%'	Finds any values that start with "a"

WHERE name LIKE '%a'	Finds any values that end with "a"

In [44]:
sum1 = cursor.execute("SELECT * FROM customerInfo WHERE name LIKE 'I%'")
for row in sum1:
    print(row)

(1, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA')
(10, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA')
(11, 'Ishaan1', 'Ishaan', 'Centre Ave', 'Pitt', 15317, 'USA')
(13, 'Ishaan2', 'K', 'Beelefonte ', 'Pitt', 15317, 'USA')
(20, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15337, 'USA')
(21, 'Ishaan1', 'Ishaan', 'Centre Ave', 'Pitt', 15347, 'India')
(23, 'Ishaan2', 'K', 'Beelefonte ', 'Pitt', 15335, 'USA')

In [46]:
sum1 = cursor.execute("SELECT * FROM customerInfo WHERE name LIKE '%n'")
for row in sum1:
    print(row)

(1, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA')
(10, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15317, 'USA')
(14, 'CoolPerson', 'A', 'Beeler Street', 'Pitt', 15217, 'USA')
(20, 'Ishaan', 'Grace', 'Forbes Ave', 'Pitt', 15337, 'USA')
(24, 'CoolPerson', 'A', 'Beeler Street', 'Pitt', 15336, 'India')